Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderTooManyStartParallelTreadsOrRunWidthFailure
The number of parallel treads at start is too great or the run width is too great.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderTooManyParallelTreadsAtHeadFailure
The number of parallel treads at start is too great.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderTooManyParallelTreadsAtEndFailure
The number of parallel treads at end is too great.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderTooManyEndParallelTreadsOrRunWidthFailure
The number of parallel treads at end is too great or the run width is too great.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderThirdLegTooShortOrRunWidthTooGreatFailure
The third leg of winder run is too short or the runwidth is too great.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderStraightStepsNumberFailure
The current layout cannot allow the specified number of treads.
Increase the length of the run leg in the model or reduce the value for Parallel Treads at Start or Parallel Treads at End.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderSecondLegTooShortOrRunwidthTooGreatFailure
The second leg of winder run is too short or the runwidth is too great.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderRunWidthOrMinWidthOrTooShortFailure
The parameter runwidth is too great or the parameter min width at inside boundary is too great, or one leg of winder run is too short.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderRunWidthOrMinWidthOrTooGreatParallelTreadsFailure
The parameter runwidth is great or the parameter min width at inside boundary is too great, or number of parallel treads at both ends is too great.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderRunWidthLessThanWalkLineOffsetFailure
The value for Run Width is less than two times of value of the inside walkline offset.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderRunWidthLessThan2TimesMinWidthFailure
The value for Minimum Width on Inside Boundary is too large to satisfy the number of Parallel Treads at the Start or End as specified in the Run Instance properties.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderRunInsideWalklineOffsetFailure
Please enter a value between 0 and half of Actual Run Width (%1/2 Actual Run Width%).

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderRunInsideMinTreadDepthFailure
Please enter a positive value less than Actual Tread Depth on Stair Path (%Actual Tread Depth%).

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderRunCreationFailure
The relationship between the current values of Actual Run Width, Minimum Width at Inside Boundary, and Parallel Treads at Start or End does not support the creation of the winder run.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderParallelTreadsNumberFailure
Cannot satisfy the number of Parallel Treads at the Start or End as specified in the Run Instance properties

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderParallelLegsFailure
Two consecutive legs are parallel.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderMinWidthTooLargeForParallelTreadsFailure
The value for Minimum Width on Inside Boundary is too large to satisfy the number of Parallel Treads at the Start or End as specified in the Run Instance properties.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderMinWidthTooLargeFailure
The value for Minimum Width on Inside Boundary is too large.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderLegsAngleTooGreatOrRunWidthTooSmallFailure
The angle between two consecutive legs are too great or the runwidth is too small.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderLegTooShortOrRunWidthTooGreatFailure
One leg of the winder run is too small or the runwidth is too great.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderLegIsTooShortFailure
A winder leg is too short.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderGenericError
Cannot make winder.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderFirstLegTooShortOrRunWidthTooGreatFailure
The first leg of winder run is too short or the runwidth is too great.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderFilletRadiusTooLargeFailure
The value for Fillet Radius is too large to satisfy the Minimum Inside Width value.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.UnexpectedCurveIntersectionFailure
Computing curve intersection and find the invalid result.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.UnableToCreateMultistoryStairs
Unable to create Multistory stairs.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.TreadFrontProfileInvalid
This profile cannot be used for the front of treads.  Please choose a profile composed of a closed loop of lines with exactly one lines coincident with the y-axis.  This lines will define the connection of this profile to the tread.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.TreadDepthTooBigFailure
The tread depth is too large for the spiral run.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.TreadDepthFailsEq
The actual tread depth and riser height for one or more stairs of this type violates the stair equation.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.TreadDepthBelowMin
The Actual Tread Depth for one or more Stairs violates the Minimum Depth set in the type.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.TooShortCurveDowngradeGeometry
Curve is too short and may downgrade the geometry.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StringerCurvesNotSplitStairs
The slope of stringer may not parallel runs and landings.  To get a parallel stringer, split boundary lines at the ends of landings.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StringerCurveTooShort
A piece of boundary is too short to create stringer on it.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsZeroDesiredRisers
The number of desired risers for a staircase cannot be 0.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsWinderInvalidParamsFailure
Cannot create the winder run because some values for the instance properties cannot be satisfied.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsWinderGenLayoutFailure
Fail to generate run layout and then cannot make winder run

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsTopLowerThanBaseFailure
The top of the Stair is lower than the base of the Stair

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsTopEndExceedsOrNotReachWarning
Stair top end exceeds or cannot reach the top elevation of the stair. Add/remove risers at the top end or change top elevation settings in Stair Properties.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsSupportTooShort
A short support is being created.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsSupportOverlapFailure
Some supports overlap with others

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsSubElementsNotConnectedWarning
Stair sub-elements are not connected

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsStringerCannotBeCreated
The stairs stringer cannot be created.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsStartHigherThanEnd
The stairs' base (Base Level + Base Offset) must be below its top (Top Level + Top Offset).

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsRunRunJoinNotAllowedFailure
Run-Run join is not allowed of they have same "Start With Riser"/"End With Riser" configuration at the joined end.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsPathPositionResetWarning
The stairs path doesn't intersect with riser lines.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsOtherThan2IntsByRiserAndBoundaryFailure
More than 2 intersection points between riser segment and boundary encountered

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsOnlySingleBoundaryHasRiserWithBothEndsOnBoundaryFailure
Only single boundary case may have riser with its both ends on boundary.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsInMultistoryExceedTopConstraint
Stairs in MultistoryStairs after adjusting still exceed the top constraint.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsIllegalDesiredNumRisers
Desired Number of Risers is too small. Computed Actual Riser Height is greater than Maximum Riser Height allowed by type.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsGenericTransformFailure
Cannot change base elevation of Stairs

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsGenericFailure
Stairs generic failure

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsCrossingRisersDisallowedFailure
Crossing risers are not allowed

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsComponentJoinFailure
Can't keep elements joined.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsCommonRunGenerateLayoutFailure
Fail to get base line thus fail to generate run layout

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsCannotExtendToFloorStructureLayerWarning
Stairs cannot extend to floor structure layer.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsBottomEndExceedsOrNotReachWarning
Stair bottom end exceeds or cannot reach the base elevation of the stair. Add/remove risers at the bottom end or change base elevation settings in Stair Properties.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsAutomaticLandingLayoutWarn
Fail to generate the automatic landing layout

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsAutomaticLandingLayoutFailure
Fail to generate the automatic landing layout

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsAreUpdatedDueToLevelHeightChange
Stair component(s) in the multistory stair are updated due to the level height changes.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsAlreadyAttachedToCurrentLevel
Mutistory Stairs already have a Stair attaching to this level.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsActualTreadDepthLessThanMinimumFailure
Computed actual tread depth of stairs is less than minimum tread depth defined in stairs type.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsActualRunWidthLessThanMinimumFailure
Actual run width is less than minimum run width defined in stairs type.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsActualRiserHeightGreaterThanMaximumFailure
Computed actual riser height of stairs is greater than maximum riser height defined in stairs type.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairStringerCantOffset
Inside stringer could not be created because of insufficient space.  Please disable the inside stringer or decrease its width.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairIncompleteFailure
Stair element is incomplete, not all components are logic connected.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.SpiralRunRadiusTooSmallFailure
The radius value for the run is too small.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RunTopLowerThanBottomFailure
The top elevation for the run is lower than the base elevation for the run.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RunIsJoiningLandingWithRiserSoNotchDoesNotWorkWarning
Run is joining landing with riser, so notch configuration does not take effect. Try to set run as begin/end with tread to make a notch.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RunBottomUnderStairsBottomFailure
Run bottom elevation should not be below the stairs bottom elevation.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RunBottomHigherThanTopFailure
The base elevation for the run is higher than the top elevation for the run.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RisersAtSameLocation
The highlighted risers have the same location along the boundary line.  Please move one of the two risers.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RiserThicknesssResetToZero
Monolithic Stairs without Treads can't have Risers. Riser Thickness for Stairs Type was automatically set to zero.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RiserIntWithBoundaryMoreThanOnceFailure
Riser intersects with boundary more than once.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RiserHeightIsTooSmall
Riser height is too small.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RiserCurveTooShort
Riser curve is too short to create nosing on it.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RampStartHigherThanEnd
The ramp's base (base level + base offset) must be below its top (top level + top offset).

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RampRunTooComplex
Ramp Run has complex boundary and may produce unreasonable geometry. Split it into few Runs by inserting Riser Lines
at the end of each Run and at the beginning of the next one. If you want to create Ramp with arc an straight section you can do it using a Run tool.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RampLandingNotCreated
Beginning of run coincide with the end of previous run. Landing is not created between runs.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RampDoesntReachOffset
The ramp is not long enough to reach the top constraint plus top offset.  Change the slope or increase the length of the ramp.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RampDoesntReach
The ramp is not long enough to reach the top constraint.  Change the slope or increase the length of the ramp.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailingNotConnected
The Railing line must be a single connected Sketch. If you want separate pieces of Railing,  create two or more separate Railings.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailingDoublyConnected
Railings hosted on Stairs must form a single,  open,  connected line.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailingCurvesNotSplitStairs
The slope of this railing may not parallel the stairs at runs and landings.  To get a parallel railing, split the railing sketch at the ends of landings.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailingCurvesNotSplitRamp
The slope of this railing will not parallel the ramp at landings.  To get a parallel railing, split the railing sketch at the ends of landings.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailingBadOffset
An arc in the railing sketch has a radius that conflicts with the current rail widths and offsets.  Please  either increase the radius or modify rail profiles and offsets.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailTypeChangeInconsistancyWarningWithResetBtn
Some rail type changes are not consistent with your rail instances customization in this project, you can reset them to make them corresponding with your changes.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailProfileOpen
Open Profile Loop can't be used as a Rail Profile

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailProfileLowerThanFilletFailure
Fillet cannot be created between rail segment since the radius is lower than the profile size.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailProfileLowerThanFilletError
Fillet cannot be created between rail segment since the radius is lower than the profile size.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailPlacedOutsideOfHost
Railings are placed completely outside the host. It may change the adjustment of the railing to the host and its vertical position.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailPathCloseLoopForExtensionWarning
The rail path is closed at the start and end path point for extension creation.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailCurveTooShort
Curve in rail sketch is too short for rail creation and ignored.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.PathDoesntJoinToBorderRisersFailure
Path doesn't join to border risers is not allowed.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.PartOfRiserLiesOnBoundaryFailure
Part of the riser lies on the boundary is not allowed.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.OnlyMonolithicStairs
Tread thickness can't be zero for non-monolithic stairs

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.NotchThicknessIsLargerThanLandingWarning
The notch thickness is larger than landing.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.NotEnoughRisers
Actual Number of Risers is different from Desired Number of Risers. Add/remove Risers or change Desired Number of Risers in Stairs Properties.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.NotALineRiserRampError
Riser line must be a straight line for Ramps.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.NotALineRiserRamp
Riser line must be a straight line for Ramps.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.NoRunsRampError
Ramp has no Runs. Can't create Ramp.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.NoRunsRamp
Ramp has no Runs. Can't create Ramp.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.NoRisersInPureMonolithicStairs
Monolithic Stairs with zero tread thickness can't have risers

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.NoRailingsStringer
Railings and Stringers will not be automatically generated due to bad Runs. This message may be incorrect if you have Edited the Sketch and modified some dimensions.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.NoProfileForRail
Must specify Profiles for every Rail.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.NoCurvesInRailing
Railing Sketch has no Lines.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.MultusegmentRampRiserError
Ramp can't have multisegment Riser.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.MultusegmentRampRiser
Ramp can't have multisegment Riser.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.MultistoryStandardStairTopEndExceedsOrNotReach
One of the stairs inside multistory stairs top ends exceed or cannot reach the top elevation of the stair.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.MultistoryStandardStairBottomEndExceedsOrNotReach
One of the stairs inside multistory stairs bottom ends exceeds or cannot reach the base elevation of the stair.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.MultistoryStairsHideTopLevelParameter
You have set the stair's multistory top level to None, and Revit will remove this parameter, if you want to create a multistory stair, please use Create Multistory Stair feature.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.MultistoryStairsComponentJoinFailure
Can't keep elements joined. Avoid converting stairs to skeched-based component in Multistory stairs.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.MultistoryStairsAutomaticLevelLandingsDeleted
Level landings are deleted because the connected stairs have been regenerated.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.MultistoryStairDoesntReach
The multistory stair/ramp could not reach its top level with integral number of flights.  Maximum number of flights below the top level is created.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.MultistoryLevelBelowTopbottomLevelError
Multistory top level must be above the stair/ramp top and bottom levels.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.MultistoryLevelBelowTopbottomLevel
Multistory top level must be above the stair/ramp top and bottom levels.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.MayUnjoinRailAndSupports
Fillet may cause the supports unjoin with the rail.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.LandingShapeHandleOnPinnedRunFailure
Cannot Drag the automatic landing shape handle control because the connected run is pinned.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.LandingHeightUnderStairsBottom
Cannot make landing because height of landing is equal or less than to bottom height of the stair.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.LandingDepthIsLessThanRunWidthWarning
Landing depth is less than run width.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.InvalidStartLevelRamp
The start level and end level for this ramp must be at different elevations.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.InvalidStartLevel
The start level and end level for this staircase must be at different elevations.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.InvalidStairsPathFailure
Invalid stairs path provided.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.InvalidRailProfile
Profiles for one or more of the Rails are invalid. Make sure that every used Profile is a closed series of non-intersecting Lines.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.InvalidParameters
Stairs run or landing has invalid parameter(s).

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.InvalidLocationLineJustificationFailure
Modify the location justification to a invalid value.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.InvalidBalustersPattern
Invalid Balusters Pattern

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.IntermediateLandingHigherThanTopRunFailure
Run is reversed.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.HeightOfRunIsTooSmall
Height of run is too small.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.FailToReOrientSketchCurvesFailure
Failed to orient sketch curves.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ExtendBelowBaseGreaterThanRunTopElevation
Extend Below Base needs to be less than Run Top Elevation.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ExtendBelowBaseGreaterThanLandingBaseElevation
Extend Below Base needs to be less than Landing Base Elevation.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ContinuousRailTransitionFailure
Cannot create specified transition at rail path turn, hand Rail/Top Rail cannot maintain continuous.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ContinuousRailSupportPlacementFailure
Cannot place the supports along the rail path.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ContinuousRailNotContinuous
The rail is non-continuous.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ContinuousRailGometryCreationFailure
Cannot create the continuous rail geometry.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ContinuousRailFilletCreationWarning
Cannot create specified fillet at rail path corner.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ContinuousRailFilletCreationParallel
Cannot create specified fillet at rail path corner because of the curves are already smoothed.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ContinuousRailFilletCreationError
Cannot create specified fillet at rail path corner.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotSplitRailingWithExtensions
Railings with extensions cannot be split.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotProcessInStairsSketchEditMode
Cannot process when stair(s) in sketch edit mode.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotPlaceRailingOnStringerWarning
Railing is placed on tread because there is no stringer.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotPlaceBalusterPatterns
Can't place Baluster Patterns

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotPlaceBalusterOffset
Can't place Balusters and/or Rails with desired offset

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotOffsetRail
Can't create one or more Rails with desired offset

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotOffsetBoundary
Can't create Boundary as an offset of Run Curve

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotMakeLanding
Can't make landing.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotGenerateRampError
Couldn't generate surfaces for ramp.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotGenerateRamp
Couldn't generate surfaces for ramp.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotGenerateFacesError
Couldn't generate surfaces for stairs.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotGenerateFaces
Couldn't generate surfaces for stairs.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotEndWithZeroRiser
Can't end Stairs with Riser because Riser Thickness is too small.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotDrawStairsError
Can't make stairs

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotDrawStairs
Can't make stairs

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateStringers
Can't create stringers geometry.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateStairForLevelOverlapping
Some of the multistory stairs couldn't be created due to the overlapped levels.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateSideStringer
Can't create one or more Side Stringers.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateRiser
Can't create geometry for one or more risers.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateRailWarn
Can't create Railing. Thickness of Rail or Balusters might be too small. If you don't want Balusters,  specify "None" for Baluster Shape.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateRailGeom
Can't create geometry for one or more Rails

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateRail
Can't create Railing. Thickness of Rail or Balusters might be too small. If you don't want Balusters,  specify "None" for Baluster Shape.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateOpenMiddleStringers
Can't cut open/middle stringers geometry.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateOneOrMoreTreads
Can't create geometry for one or more treads.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateOneOrMoreBaluster
Can't create one or more Balusters

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateNosing
Can't create nosing on one or more treads.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateMonolithicStairs
Can't make monolithic Stairs.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateMiddleStringer
Can't create one or more Middle Stringers.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateLandingStringer
Can't create stringer at landing.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateCornerBalusters
Can't create corner Baluster

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateBalusterPatterns
Can't create Baluster Patterns for Railings

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateBaluster
Can't create Balusters for given Width and Height.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotComputeRailElevation
Can't compute elevation profile for one or more Rails

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotAlignSupportOnPosts
Cannot align the support on the posts.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.BalustersTooCloseAbsolute
Baluster Separation is too small.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.BalustersTooClose
Baluster Separation must be equal to or greater than the Baluster widths.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.BalusterUpsideDown
Top reference is below Bottom reference for one or more Balusters. These Balusters are not created.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.BadTreadRiserProfile
Tread/Riser profile is invalid.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.BadRailingsError
Can't create Railings.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.BadRailings
Can't create Railings.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.BadRailProfile
One or more Profile Loops are invalid, probably because of self-intersection.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.BadFillingSpacing
Spacing for Excess Length Fill is too small.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.BadBalustersPerTread
Number of Balusters per Tread must be an integer greater than zero.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.AutomaticLandingConvertedToSketchedLandingWarning
Some run(s) are deleted, so automatic landing is converted to sketched landing.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ArcRunWidthTooLongFailure
Arc run width is too long.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ArcRunRadiusTooSmall
Can't create Run. Run radius is too small.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.AntiparallelRampRisersError
Riser lines are parallel but not collinear. Can't build Run between these Risers.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.AntiparallelRampRisers
Riser lines are parallel but not collinear. Can't build Run between these Risers.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ActualRiserHeightChanged
The actual riser height for one or more stairs violates the maximum set in the type.

Autodesk.Revit.DB.BuiltInFailures.StairRampFailures
Failures about StairRamp.